Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_LL_CORE/Src/USB_LL_Host.c
void USB_LL_Host___Channel_Set_Retry_After_Halt(uint8_t port_Number, uint8_t channel_Number, uint8_t value)
{
	USB_LL_Host___Status[port_Number].channel_Status[channel_Number].retry_After_Halt = value;
}

void USB_LL_Host___Channel_Retry_Transfer_Out(uint8_t port_Number, uint8_t channel_Number)
{
	USB_LL_Host___Channel_Begin_Transfer_Out(port_Number, channel_Number);
}

void USB_LL_Host___Channel_Retry_Transfer_In(uint8_t port_Number, uint8_t channel_Number)
{
	USB_LL_Host___Channel_Begin_Transfer_In(port_Number, channel_Number);
}

// -----------------------------------------------------------------------------------

uint8_t USB_LL_Host___Is_Start_Of_Frame(uint8_t port_Number)
{
	return(USB_LL_Host___Status[port_Number].is_Start_Of_Frame);
}

void USB_LL_Host___Clear_Start_Of_Frame(uint8_t port_Number)
{
	USB_LL_Host___Status[port_Number].is_Start_Of_Frame = false;
}

uint8_t USB_LL_Host___Get_Root_Device_Speed(uint8_t port_Number)
{
	uint8_t return_Value = USB_LL_Host___Status[port_Number].root_Device_Speed;
	return(return_Value);
}

void USB_LL_Host___Clear_Connection_Status_Change(uint8_t port_Number)
{
	USB_LL_Host___Status[port_Number].is_Root_Device_Connection_Status_Change = false;
}

uint8_t USB_LL_Host___Is_Root_Device_Connection_Status_Change(uint8_t port_Number)
{
	uint8_t return_Value = USB_LL_Host___Status[port_Number].is_Root_Device_Connection_Status_Change;
	return(return_Value);
}

uint8_t USB_LL_Host___Is_Root_Device_Connected(uint8_t port_Number)
{
	return(USB_LL_Host___Status[port_Number].is_Root_Device_Connected);
}

uint8_t USB_LL_Host___Is_Root_Device_Disconnected(uint8_t port_Number)
{
	return(USB_LL_Host___Status[port_Number].is_Root_Device_Disconnected);
}

uint8_t USB_LL_Host___Get_All_Channels_Status_Change_Flag(uint8_t port_Number)
{
	return (USB_LL_Host___Status[port_Number].all_Channels_Status_Change_Flag);
}

void USB_LL_Host___Clear_All_Channels_Status_Change_Flag(uint8_t port_Number)
{
	USB_LL_Host___Status[port_Number].all_Channels_Status_Change_Flag = false;
}

uint8_t USB_LL_Host___Get_Channel_Status(uint8_t port_Number, uint8_t channel_Number)
{
	return(USB_LL_Host___Status[port_Number].channel_Status[channel_Number].exit_Status);
}

uint8_t USB_LL_Host___Get_Channel_Status_Change_Flag(uint8_t port_Number, uint8_t channel_Number)
{
	return (USB_LL_Host___Status[port_Number].channel_Status[channel_Number].transfer_Complete);
}

uint8_t USB_LL_Host___Channel_Is_Busy(uint8_t port_Number, uint8_t channel_Number)
{
	return(USB_LL_Host___Status[port_Number].channel_Status[channel_Number].busy);
}

void USB_LL_Host___Transfer_Complete(uint8_t port_Number, uint8_t channel_Number, uint8_t status)
{
	//printf("E%d\n", channel_Number);
	USB_LL_Host___Status[port_Number].channel_Status[channel_Number].transfer_Complete 		= true;
	USB_LL_Host___Status[port_Number].channel_Status[channel_Number].transfer_Complete_Flag 	= true;
	USB_LL_Host___Status[port_Number].channel_Status[channel_Number].exit_Status 			= status;
}

void USB_LL_Host___Channel_Receive_Overflow(uint8_t port_Number, uint8_t channel_Number)
{
	// currently working on this.
	USB_LL_Host___Channel_Halt(port_Number, channel_Number);
	USB_LL_Host___Transfer_Complete(port_Number, channel_Number, USB_LL_Host___CHANNEL_STATUS_TRANSFER_FAILED_ERROR);
}

void USB_LL_Host___Packet_Received(uint8_t port_Number)
{
	USB_OTG_GlobalTypeDef* 		USB 				= USB_LL___Get_USB(port_Number);

	uint32_t 					RX_Status        	= USB -> GRXSTSP;
	uint8_t 					channel_Number     	= USB_LL___GET_BIT_SEGMENT(RX_Status, USB_OTG_GRXSTSP_EPNUM_Msk, USB_OTG_GRXSTSP_EPNUM_Pos);

	USB_OTG_HostChannelTypeDef* USB_Host_Channel 	= USB_LL___Get_USB_Host_Channel(port_Number, channel_Number);

	uint8_t						packets_Remaining 	= USB_LL___GET_BIT_SEGMENT(USB_Host_Channel -> HCTSIZ, USB_OTG_HCTSIZ_PKTCNT_Msk, USB_OTG_HCTSIZ_PKTCNT_Pos);
	uint8_t 					packet_Status 		= USB_LL___GET_BIT_SEGMENT(RX_Status, USB_OTG_GRXSTSP_PKTSTS_Msk, USB_OTG_GRXSTSP_PKTSTS_Pos);
	uint8_t 					byte_Count			= USB_LL___GET_BIT_SEGMENT(RX_Status, USB_OTG_GRXSTSP_BCNT_Msk, USB_OTG_GRXSTSP_BCNT_Pos);

	if(packet_Status == USB_LL_Host___RX_PACKET_STATUS_DATA_PACKET_RECIEVED)
	{
		if(byte_Count + USB_LL_Host___Status[port_Number].channel_Status[channel_Number].transfer_Progress > USB_LL_Host___Status[port_Number].channel_Status[channel_Number].transfer_Size)
		{
			byte_Count = 0;
			USB_LL_Host___Channel_Receive_Overflow(port_Number, channel_Number);
		}

		USB_LL_Host___Status[port_Number].channel_Status[channel_Number].transfer_Progress += byte_Count;

		if(byte_Count > 0)
		{

			(void)USB_LL_Host___Channel_RX_POP(port_Number, channel_Number, RX_Status);

			if(packets_Remaining > 0)
			{
				USB_Host_Channel -> HCCHAR |= (USB_OTG_HCCHAR_CHENA);
			}
		}
	}
}


void USB_LL_Host___Device_Connect_Detected(uint8_t port_Number)
{
	USB_OTG_HostPortTypeDef*	USB_Host_Port 	= USB_LL___Get_USB_Host_Port(port_Number);
	USB_OTG_HostTypeDef* 		USB_Host 		= USB_LL___Get_USB_Host(port_Number);
	if(!(USB_Host -> HCFG & USB_OTG_HCFG_FSLSPCS))
	{
		USB_Host -> HFIR  = (USB_LL_HOST___CLOCK_CYCLES_IN_ONE_MILLISECOND_FRAME);
		USB_Host -> HCFG |= (USB_OTG_HCFG_FSLSPCS_0);
		USB_LL_Host___Reset_Port(port_Number);
	}
	else
	{
		uint8_t host_Speed = USB_LL___GET_BIT_SEGMENT(USB_Host_Port -> HPRT, USB_OTG_HPRT_PSPD_Msk, USB_OTG_HPRT_PSPD_Pos);
		uint8_t speed;

		if(host_Speed == USB_LL_Host___HPRT_LOW_SPEED_VALUE)
		{
			speed = USB_LL_Host___LOW_SPEED_VALUE;
		}
		else if(host_Speed == USB_LL_Host___HPRT_FULL_SPEED_VALUE)
		{
			speed = USB_LL_Host___FULL_SPEED_VALUE;
		}
		else if(host_Speed == USB_LL_Host___HPRT_HIGH_SPEED_VALUE)
		{
			speed = USB_LL_Host___HIGH_SPEED_VALUE;
		}

		USB_LL_Host___Status[port_Number].is_Root_Device_Connection_Status_Change 	= true;
		USB_LL_Host___Status[port_Number].is_Root_Device_Connected 					= true;
		USB_LL_Host___Status[port_Number].is_Root_Device_Disconnected 				= false;
		USB_LL_Host___Status[port_Number].root_Device_Speed 							= speed;
	}
}


